---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistHoriz
source: html/d6fde6af-18be-89ec-341d-70aa38e25200.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistHoriz Property

"Use Curve Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridUseCurveDistHoriz { get; }
```